In [1]:
import matplotlib as plt
import seaborn as sns
import pandas as pd
import statsmodels.api as sm
import numpy as np
from scipy import stats

In [2]:
df = pd.read_csv("salary.csv")

In [3]:
df.head()

,salary,exprior,yearsworked,yearsrank,market,degree,otherqual,position,male,Field,yearsabs
0,53000.0,0,0,0,1.17,1,0,1,1,3,0
1,58000.0,1,0,0,1.24,1,0,1,1,2,0
2,45500.0,0,0,0,1.21,1,0,1,1,3,2
3,35782.0,0,2,1,0.99,1,0,1,1,4,1
4,34731.0,0,2,2,0.91,1,0,1,1,4,1

In [4]:
df.describe()

,salary,exprior,yearsworked,yearsrank,market,degree,otherqual,position,male,Field,yearsabs
count,513.000000,514.000000,514.000000,514.000000,514.000000,514.000000,514.000000,514.000000,514.000000,514.000000,514.000000
mean,50863.220098,2.926070,12.852140,7.052529,0.948521,0.964981,0.044747,2.132296,0.750973,2.529183,6.982490
std,12685.132358,4.791397,9.444695,6.414771,0.149380,0.184008,0.206950,0.820075,0.432871,1.127420,16.873156
min,29000.000000,0.000000,0.000000,0.000000,0.710000,0.000000,0.000000,1.000000,0.000000,1.000000,0.000000
25%,40000.000000,0.000000,4.000000,2.000000,0.840000,1.000000,0.000000,1.000000,1.000000,2.000000,0.000000
50%,50096.000000,0.500000,12.000000,5.000000,0.920000,1.000000,0.000000,2.000000,1.000000,3.000000,1.000000
75%,60345.000000,4.000000,22.000000,12.000000,1.020000,1.000000,0.000000,3.000000,1.000000,4.000000,2.000000
max,96156.000000,25.000000,41.000000,28.000000,1.330000,1.000000,1.000000,3.000000,1.000000,4.000000,118.000000

In [5]:
df.isnull().sum()

salary         1
exprior        0
yearsworked    0
yearsrank      0
market         0
degree         0
otherqual      0
position       0
male           0
Field          0
yearsabs       0
dtype: int64

In [6]:
df.dtypes

salary         float64
exprior          int64
yearsworked      int64
yearsrank        int64
market         float64
degree           int64
otherqual        int64
position         int64
male             int64
Field            int64
yearsabs         int64
dtype: object

In [7]:
max_min = df['salary'].describe().loc[['min','max']]
max_min

min    29000.0
max    96156.0
Name: salary, dtype: float64

In [8]:
salary_mean = np.mean(df['salary'])
salary_mean

50863.22009783626

In [9]:
q2 = df['salary'].median()
q2

50096.0

In [10]:

q1 = df["salary"].quantile(0.25)
q3 = df["salary"].quantile(0.75)
iqr = q3 - q1
iqr

20345.0

In [11]:
print(df['salary'].min())
print(df['salary'].max())

29000.0
96156.0

In [12]:
new_name = {0:'female', 1:'male'}
df.replace(new_name, inplace=True)

In [13]:
total_gender = df['male'].value_counts()
total_gender
table = {'male': [386], 'female': [128]}

In [14]:
x = {'male': [386], 'female': [128]}
table = pd.DataFrame(data=table)
table

   male  female
0   386     128

In [29]:
male_execs= df[(df['position']==3) & (df['male']=='female')]

male_execs.male.value_counts()

female    19
Name: male, dtype: int64

In [16]:
female_execs= df[(df['position']==3) & (df['male']=='female')]
male_execs.male.value_counts()

male    192
Name: male, dtype: int64

In [17]:
difference = len(male_execs) - len(female_execs)
difference

173

In [18]:
plt.figure(figsize=(10,5))
plt.hist(df['salary'])
plt.show()

TypeError: 'module' object is not callable

In [28]:
female_salary = df[df['male']=='female'].salary.mean()
female_salary

42916.60479734375

In [ ]:
males = len(df.male == 'men')
females = len(df.male == 'female')
print(females)

In [ ]:
no_mobile_money = len(male[male.mobile_money_classification == 0]